In [25]:
import pyodbc
import pandas as pd

In [26]:
conn = pyodbc.connect(r'Driver={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=E:\python_projects\Tutorial\dbtest.accdb;')

In [30]:
Ql_Query = pd.read_sql_query(
'''select 
Product_Name, Product_price_unit, units_ordered, ((units_ordered)*(Product_price_unit)) AS revenue
    from trackingsales''', conn)

In [31]:
display(QL_Query)

       Product_Name Product_price_unit units_ordered  revenue
0  Desctop Computer                500             5   2500.0
1           monitor                200             5   1000.0
2         Telephone                150             2    300.0
3           printer                150             3    450.0
4             chair                100             1    100.0

In [33]:
df=pd.DataFrame(QL_Query, columns=['Product_Name', 'Product_price_unit', 'units_ordered', 'revenue'])

In [34]:
display(df)

       Product_Name Product_price_unit units_ordered  revenue
0  Desctop Computer                500             5   2500.0
1           monitor                200             5   1000.0
2         Telephone                150             2    300.0
3           printer                150             3    450.0
4             chair                100             1    100.0

In [36]:
max1 = df['revenue'].max()
print(max1)

2500.0

In [39]:
from dbmodule import connect

ModuleNotFoundError: No module named 'dbmodule'